## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_service_account_key.external-dns will be created
+   resource "google_service_account_key" "external-dns" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
+       public_key         = (known after apply)
+       public_key_type    = "TYPE_X509_PEM_FILE"
+       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com"
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # kubernetes_secret.external-dns-credentials will be created
+   resource "kubernetes_secret" "external-dns-credentials" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           namespace        = "dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.external-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.external-dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/dns.admin"
    }

  # module.external-dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
